app/mailers/appointment_mailer.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def appointment_confirmation_email(appointment)
    @user = params[:user]
    @user_appointment = User.where(id: appointment.doctor_id).first

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def appointment_rescheduled_email(appointment)
    @user = params[:user]
    @user_appointment = User.where(id: appointment.user_id).first