app/controllers/appointments_controller.rb

  def index
    #  @appointments = Appointment.all
    @q = Appointment.ransack(params[:q])
    @appointments = pagination(@q.result)
    @users = params[:specialities_id].present? ? Profile.find(params[:specialities_id]).user : User.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 19], ["LIMIT", 1]]

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
        AppointmentMailer.with(user: current_user).appointment_confirmation_email(@appointment).deliver_now
---
INSERT INTO "appointments" ("appointment_datetime", "user_id", "created_at", "updated_at", "completed", "doctor_id", "specialities_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1 AND (appointment_time < '2021-10-17 18:16:00')  [["user_id", 2]]

  def update
    respond_to do |format|
      if @appointment.update(update_params)
        AppointmentMailer.with(user: current_user).appointment_rescheduled_email(@appointment).deliver_now
---
UPDATE "appointments" SET "appointment_date" = $1, "appointment_time" = $2, "updated_at" = $3 WHERE "appointments"."id" = $4  [["appointment_date", "2021-10-10"], ["appointment_time", "13:53:00"], ["updated_at", "2021-10-06 12:04:30.342340"], ["id", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1  [["user_id", 1]]

  def destroy
    @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 2]]

  def set_appointment
    @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]