app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "email", "contact", "specialities", "reg_no", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "specialities" = $1, "user_id" = $2, "updated_at" = $3 WHERE "profiles"."id" = $4  [["specialities", "MD"], ["user_id", 3], ["updated_at", "2021-10-19 13:31:58.968018"], ["id", 1]]