app/models/appointment.rb

  def appointment_datetime_cannot_be_in_the_past
    if appointment_datetime.present? && appointment_datetime < DateTime.now
---
SELECT "appointments".* FROM "appointments"