app/models/user.rb

  def assign_role
    self.role = Role.find_by name: 'Patient' if role.nil?
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Patient"], ["LIMIT", 1]]