app/views/appointments/_form.html.erb

      }
      $.ajax({
        url: "/user",
        method: "GET",
        dataType: "json",
        data: {appointment: appointment},
        error: function (xhr, status, error) {
            console.error('AJAX Error: ' + status + error);
        },
        success: function (response) {
            console.log(response);
            var appointment = response["appointment"];
            $("#appointment_doctor_id").empty();

            $("#appointment_doctor_id").append('<option>Select Task</option>');
            for(var i = 0; i < specialities.length; i++){
              $("#appointment_doctor_id").append('<option value="' + specialities[i]["id"] + '">' +specialities[i]["email"] + '</option>');
            }
        }
      });
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1 AND (appointment_time < '2021-10-17 18:16:00')  [["user_id", 2]]