app/views/layouts/application.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
        Not you?
          <% if current_user.profile.present? %>